%Линейный классификатор
%2 класса, равные корреляционные матрицы

M1 = [2; 2];
R1 = [1 0.1; 0.1 0.7];

M2 = [0; 2];
R2 = [1 0.2; 0.1 0.3];

fileData = load('data_equal_1');
X1 = fileData.X1;
fileData = load('data_equal_2');
X2 = fileData.X2;
N = 200;

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%1 часть%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Вычисление дисперсии
%!Реализовать вычисление

%Линейный классификатор Фишера
%Коэффициенты линейной дискриминантной функции

WF = inv(0.5*(R1 + R2))*(M2 - M1);
%!Реализовать вычисление wN

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%2 часть%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Линейный СКО-классификатор
for i=1:N
    u(1, i) = 1;
    u(2, i) = X1(1, i);
    u(3, i) = X1(2, i);
    g(1, i) = 1;
end

for k=(N+1):2*N
    u(1, k) = -1;
    u(2, k) = -X2(1, k-N);
    u(3, k) = -X2(2, k-N);
    g(1, k) = 1;
end

%Коэффициенты линейной дискриминантной функции
%!Реализовать вычисление вектора W

%Графики
for i=1:N
    y0(i)= -1 + 3*i/N;
    ySKO1(i) = (-W(1) - W(2)*y0(i)) / W(3);
    yFISH1(i) = (-wN - WF(1)*y0(i)) / WF(2);
    %!Добавить Байес из прошлой лабораторной
end

%Отображение
figure
scatter(X1(1, :),X1(2, :), 5, 'red', 'fill');
hold on
scatter(X2(1, :),X2(2, :), 5, 'green', 'fill');
hold on
scatter(y0, yFISH1, 1, 'blue', 'fill');
xlim([-3 3])
ylim([-3 3])